┌──(hongyuliu㉿kali)-[~/…/ITJourney/Tryhackme/Network Services/Exploiting FTP]
└─$ ftp 10.10.187.3
Connected to 10.10.187.3.
220 Welcome to the administrator FTP service.
Name (10.10.187.3:hongyuliu): mike
331 Please specify the password.
Password: 
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
229 Entering Extended Passive Mode (|||16232|)
150 Here comes the directory listing.
drwxrwxrwx    2 0        0            4096 Apr 24  2020 ftp
-rwxrwxrwx    1 0        0              26 Apr 24  2020 ftp.txt
226 Directory send OK.
ftp> cat ftp.txt
?Invalid command.
ftp> get ftp.txt
local: ftp.txt remote: ftp.txt
229 Entering Extended Passive Mode (|||5892|)
150 Opening BINARY mode data connection for ftp.txt (26 bytes).
100% |***************************************************************************************************************|    26      246.51 KiB/s    00:00 ETA
226 Transfer complete.
26 bytes received in 00:00 (0.16 KiB/s)
ftp> exit
221 Goodbye.
